Revit 2024 API
BuiltInFailures.ColumnInsideWallFailures.CopingWarningExtension Property
 Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CopingWarningExtension { get; }
Visual Basic
Public Shared ReadOnly Property CopingWarningExtension As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CopingWarningExtension {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace